
 // стой
 //
 // 1. как объявит var name;
 // увидела разницу?  а почему когда равно 0 тоже under? это просто при обявлении переменной так вылазит типа глюк, результат функции
 //
 //
// // 2.
// //
// // var a =1;
// // var a = a + 1;
// //  что будет?я так понима что 2
// //
// // ну я же правильно отвеьила ну да, но нет ))
// // оно работает и так но это говнокод
// //
// //
// // если ты объявила переменную выше, зачем ты еще каждый раз в цикле ее объявляешь -- она у тебя УЖЕ ЕСТЬ я поняла
// //
// //
// // 3. тип данных
// //
// // й
//
// //     }
// // }
//
//
//
//
// function add() {
//     var a = prompt('Введите число');//это строка, а тебе нужно число!!!
//     var summ = 0; //мыобъявляем вторую переменную, но она почему-то не чего не значит и по этому пишут в дебагере underfined----------------------сейчас резберемся
//     for(var i = 0; i < a; i++){
//         debugger;
//         if (a = NaN){
//             alert('Вы ввели не число!');
//         }
//         summ = summ + a[i];// что тут? появляется что переменная еще раз объявляется и она равна самой себе (underf...
//         console.log(summ);
//     }
//
//
// }
//
// add();
//
/

